//Якщо до строки додавати число - число переведеться в строку та відбудеться конкатинація строк. В даному випадку отримаєм строку "number33"
console.log('number' + 3 + 3)

//null при переведені в число дає 0. В результаті отримаєм 3
console.log(null + 3)

//5 при переведені в буліан дає true, не пуста строка теж дає true. true i true дає true
//console.log(5 && "qwerty")

//Приводим строку '40' за допомогою префіксного +, теж саме робим з ''2. Додаем 40 до 2, отримуєм 42. Далі як в 1 прикладі відбувається конкатинація строк та отримуєм строку "42hillel"
console.log(+'40' + +'2' + "hillel");

//При відніманні числа від рядка, рядок приводиться до числа, у результаті віднімання буде 5. Строго порівнюєм числа 5 і 6. Типи співпадають, значення - ні, отримуєм false
console.log('10' - 5 === 6);

//Якщо сумуються boolean значченя, true відповідає 1, false - 0. У результаті отримаєм число 1
console.log(true + false);

//Якщо від строки яку не можна перевести в число відняти число отримаєм NaN
console.log('4px' - 3)

//Якщо від строки яку можна перевести в число відняти число отримаєм число. В даному прикладі отримаєм число 1
console.log('4' - 3);

//3 ** 0 означає 3 в 0 ступіні, що дорівнює 1. При додавані строки, яку можна перевести в число до числа отримаєм число, в даному прикладі число 7
сonsole.log('6' + 3 ** 0);

12 / '6'

'10' + (5 === 6);

null == ''

3 ** (9 / 3);

!!'false' == !!'true'

0 || '0' && 1

(+null == false) < 1;

false && true || true

false && (false || true);

(+null == false) < 1 ** 5;